Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་རྒྱལ་པོ་ནོར་ལྡན་གྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བདེ་བར་བཞུགས་པར་རིག་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་རང་གི་ལག་ནས་སྟོབས་ཤིང་ཚིམ་པར་བྱེད་དེ།
en: King Dhanasaṃmata then knew that the community of monks headed by the Perfectly Awakened One Ratnaśikhin had sat down in comfort, and with his own hands he served and satisfied them with a pure and fine meal.

source: རྣམ་པ་དུ་མར་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་རང་གི་ལག་ནས་བསྟབས་ཤིང་ཚིམ་པར་བྱས་སོ། །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱིས་གསོལ་ནས་ཕྱག་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་ཞབས་གཉིས་ལ་གཏུགས་ཏེ་འཇིག་རྟེན་འདི་དག་ཐམས་ཅད་ལ་བྱམས་པ་ཚད་མེད་པའི་ཡན་ལག་གིས་རྒྱས་པར་བྱས་ནས་སྨོན་ལམ་གདབ་པར་བརྩམས་པ།
en: When, with his own hands, he had served and satisfied them in a variety of ways with a pure and fine meal, knowing that the Perfectly Awakened One Ratnaśikhin had finished his meal and washed his hands and his bowl, the king threw himself at the feet of the Perfectly Awakened One Ratnaśikhin, filled this whole world with immeasurable love, and made this aspiration:

source: དགེ་བའི་རྩ་བ་འདིས་བདག་འཇིག་རྟེན་གྱི་སྟོན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: ‘May I become a teacher of the world, a tathāgata, an arhat, a perfectly awakened one, by this root of merit from my offering.’

source: །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: “The Perfectly Awakened One Ratnaśikhin said, ‘Great King, you will become the tathāgata, the arhat, the perfectly awakened one named Maitreya when the human lifespan is eighty thousand years.’

source: །དགེ་སློང་དག་དེ་ལྟར་ན་སྨོན་ལམ་གྱི་དབང་གིས་དཀོན་མཆོག་གཉིས་ཅིག་ཅར་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: “Thus, monks, by the power of an aspiration, two treasures will appear in the world at the same time.” E. The Sermon in Kuṭi Village

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་གྲོང་སྤྱིལ་བུ་ཅན་ཞེས་བྱ་བ་གང་ན་བ་དེར་འདོང་ངོ་།
en: Thereupon the Blessed One said to the venerable Ānanda, “Ānanda, let us go to the village named Kuṭi.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཡུལ་སྤོང་བྱེད་ཅེས་བྱ་བ་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་དང་། གྲོང་སྤྱིལ་བུ་ཅན་དུ་བྱོན་ཏོ།
en: And so the Blessed One, traveling through the country of Vṛji, arrived in Kuṭi Village.

source: །གྲོང་སྤྱིལ་བུ་ཅན་གྱི་གྲོང་ཁྱེར་གྱི་བྱང་ཕྱོགས་ཀྱི་ཤིང་ཤ་པའི་ཚལ་ན་བཞུགས་སོ།
en: He stayed in a śiṃśapā forest to the north of Kuṭi Village.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ནི་ཚུལ་ཁྲིམས་ཡིན་ནོ།
en: Then the Blessed One said to the monks, “Monks, this is moral conduct.

source: །འདི་ནི་ཏིང་ངེ་འཛིན་ཡིན་ནོ་འདི་ནི་ཤེས་རབ་ཡིན་ནོ།
en: This is meditation. This is wisdom.

source: །དགེ་སློང་དག་ཚུལ་ཁྲིམས་གོམས་པར་བྱས་ན་ཏིང་ངེ་འཛིན་ཡུན་རིང་དུ་གནས་པར་འགྱུར་རོ།
en: Monks, if you practice moral conduct, your meditation will long endure.

source: །ཏིང་ངེ་འཛིན་གོམས་པར་བྱས་ན་ཤེས་རབ་ཡུན་རིང་དུ་གནས་པར་འགྱུར་རོ།
en: If you practice meditation, your wisdom will long endure.

source: །ཤེས་རབ་གོམས་པར་བྱས་ན་འདི་ལྟ་སྟེ། འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་དག་ལས་སེམས་ཡང་དག་པ་ཁོ་ནར་རྣམ་པར་གྲོལ་བར་འགྱུར་རོ།
en: If you practice wisdom, your mind will be perfectly liberated from desire, anger, and delusion.

source: །དེ་ལྟར་སེམས་ཡང་དག་པ་ཁོ་ནར་རྣམ་པར་གྲོལ་བའི་འཕགས་པའི་ཉན་ཐོས་ཀྱིས་ནི་བདག་གི་ཟག་པ་ནི་ཟད་དོ།
en: A noble disciple whose mind has thus been perfectly liberated will perfectly understand: ‘My defilements have been exhausted.

source: །ཚངས་པར་སྤྱོད་པ་ནི་བསྟེན་ཏོ།
en: The pure life has been lived.

source: །འདི་ལས་སྲིད་པ་གཞན་མི་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཁོ་ནར་ཤེས་པར་འགྱུར་རོ།
en: I will not know another existence after this one.’ ”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་སྒྲ་ཅན་གང་ན་བར་འདོང་ངོ་།
en: Thereupon the Blessed One said to the venerable Ānanda, “Ānanda, let us go to *Nādikā.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དང་སྤོང་བྱེད་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་དང་། སྒྲ་ཅན་དུ་བྱོན་ནས་སྒྲ་ཅན་གྱི་དྲང་སྲོང་སྒྲ་སྒྲོགས་ཀྱི་གནས་ན་བཞུགས་སོ།
en: Thereupon the Blessed One, traveling through the country of Vṛji, arrived in Nādikā. He stayed at the ṛṣi Guṃjika’s abode (Guṃjikāvasatha) in Nādikā.

source: །དེའི་ཚེ་སྒྲ་ཅན་གྱི་སྐྱེ་བོའི་ཚོགས་ལ་མི་ངས་བྱུང་ནས་དེའི་ཚེ་དགེ་བསྙེན་བརྟན་པ་ཡང་ཤི་ཉེ་བ་དང་ལྷག་པར་བརྩོན་དང་། བརྩོན་པའི་ཁྱུ་མཆོག་དང་མཛེས་པ་དང་། ཉེ་མཛེས་དང་ཡིད་འོང་དང་ཉེ་བར་ཡིད་འོང་དང་བཟང་པོ་དང་ཤིན་ཏུ་བཟང་དང་གྲགས་པ་དང་གྲགས་བྱིན་དང་དགེ་བསྙེན་གྲགས་མཆོག་ཀྱང་ཤིའོ།
en: At that time, an epidemic had broken out among the people of Nādikā, and the lay brother Karkaṭaka had died. Nikaṭa, Kaḍaṅgara, Kātyarṣabha, Cāru, Upacāru, Ariṣṭa, Upāriṣṭa, Bhadra, Subhadra, Yaśas, Yaśodatta, and the lay brother Yaśottara had also died.

source: །དེ་ནས་དགེ་སློང་རབ་ཏུ་མང་པོ་སྔ་དྲོ་ཤམ་ཐབས་བགོས་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ་སྒྲ་ཅན་དུ་བསོད་སྙོམས་ཀྱི་ཕྱིར་ཞུགས་སོ། །དགེ་སློང་རབ་ཏུ་མང་པོ་སྒྲ་ཅན་དུ་བསོད་སྙོམས་ཀྱི་ཕྱིར་རྒྱུ་བས་སྒྲ་ཅན་གྱི་སྐྱེ་བོའི་ཚོགས་ལ་མི་ངས་བྱུང་སྟེ།
en: Then in the morning many monks dressed, took their bowls and their robes, and entered Nādikā for alms.

source: དེའི་ཚེ་དགེ་བསྙེན་བརྟན་པ་ཡང་ཤི་ཉེ་བ་དང་ལྷག་པར་བརྩོན་དང་། བརྩོན་པའི་ཁྱུ་མཆོག་དང་མཛེས་པ་དང་ཉེ་མཛེས་དང་། ཡིད་འོང་དང་ཉེ་བར་ཡིད་འོང་དང་བཟང་པོ་དང་ཤིན་ཏུ་བཟང་དང་གྲགས་པ་དང་གྲགས་བྱིན་དང་དགེ་བསྙེན་གྲགས་མཆོག་ཀྱང་ཤིའོ་ཞེས་ཐོས་སོ།
en: When the many monks were walking around Nādikā for alms, they heard that an epidemic had broken out among the people of Nādikā and that at that time the lay brother Karkaṭaka had died and Nikaṭa, Kaḍaṅgara, Kātyarṣabha, Cāru, Upacāru, Ariṣṭa, Upāriṣṭa, Bhadra, Subhadra, Yaśas, Yaśodatta, and the lay brother Yaśottara had also died.

source: །ཐོས་ནས་ཀྱང་སྒྲ་ཅན་དུ་བསོད་སྙོམས་ལ་རྒྱུས་ཏེ་ཟས་ཀྱི་བྱ་བ་བྱས་ནས་ཟས་ཕྱི་མའི་བསོད་སྙོམས་སྤངས་ཤིང་།
en: After hearing this, they walked around Nādikā for alms and then took their meal.

source: ལྷུང་བཟེད་དང་ཆོས་གོས་མཁོས་སུ་ཕབ་ནས་རྐང་པ་གཉིས་བཀྲུས་ཏེ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་ནས་ལྷགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: After the meal they returned, put their bowls and their robes in order, washed their feet, and went to the Blessed One. When they had gathered, they bowed low until their foreheads touched the Blessed One’s feet, and then they sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་དགེ་སློང་རབ་ཏུ་མང་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་དགེ་སློང་རབ་ཏུ་མང་པོ་འདིར་སྔ་དྲོ་ཤམ་ཐབས་འཚལ་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ནས་སྒྲ་ཅན་དུ་བསོད་སྙོམས་ཀྱི་ཕྱིར་ཞུགས་ཏེ།
en: When they had sat down, the many monks recounted to the Blessed One, “O Honored One, Blessed One, in the morning we many monks dressed here, took our bowls and our robes, and entered Nādikā for alms.

source: བཙུན་པ་བདག་ཅག་དགེ་སློང་རབ་ཏུ་མང་པོ་སྒྲ་ཅན་དུ་བསོད་སྙོམས་ཀྱི་ཕྱིར་རྒྱུ་བ་ན་སྒྲ་ཅན་འདིར་སྐྱེ་བོའི་ཚོགས་ལ་མི་ངས་བྱུང་ནས། དེའི་ཚེ་དགེ་བསྙེན་བརྟན་པ་ཡང་གུམ། ཉེ་བ་དང་ལྷག་པར་བརྩོན་དང་བརྩོན་པའི་ཁྱུ་མཆོག་དང་། མཛེས་པ་དང་ཉེ་མཛེས་དང་ཡིད་འོང་དང་ཉེ་བར་ཡིད་འོང་དང་བཟང་པོ་དང་ཤིན་ཏུ་བཟང་དང་། གྲགས་པ་དང་གྲགས་བྱིན་དང་དགེ་བསྙེན་གྲགས་མཆོག་ཀྱང་གུམ་མོ་ཞེས་ཐོས་ལགས་ན།
en: O Honored One, when we many monks were walking around Nādikā for alms, we heard that an epidemic had broken out among the people here in Nādikā and that at that time the lay brother Karkaṭaka had died and Nikaṭa, Kaḍaṅgara, Kātyarṣabha, Cāru, Upacāru, Ariṣṭa, Upāriṣṭa, Bhadra, Subhadra, Yaśas, Yaśodatta, and the lay brother Yaśottara had also died.

source: བཙུན་པ་དེ་རྣམས་ཀྱི་འགྲོ་བ་ནི་གང་སྐྱེ་བ་ནི་གང་།
en: Honored One, what are their destinies? What are their next births?

source: སྔོན་དུ་འགྲོ་བ་ནི་གང་ལགས།
en: What are their destinations?”

source: དགེ་སློང་དག་དགེ་བསྙེན་བརྟན་པ་ནི་ཐ་མའི་ཆ་དང་མཐུན་པའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་རྣམས་སྤངས་པས་རྫུས་ཏེ་སྐྱེས་ཏེ་དེར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་ཞིང་འཇིག་རྟེན་འདིར་ཡང་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཅན་གྱི་ཕྱིར་མི་འོང་བར་འགྱུར་རོ།
en: “Monks, the lay brother Karkaṭaka, since he had abandoned the five fetters that bind one to lower states, will have a miraculous birth. There he will be completely emancipated and become a never-returner, one who will naturally never return to this world.

source: །ཉེ་བ་དང་ལྷག་པར་བརྩོན་དང་བརྩོན་པའི་ཁྱུ་མཆོག་དང་མཛེས་པ་དང་ཉེ་མཛེས་དང་ཡིད་འོང་དང་ཉེ་བར་ཡིད་འོང་དང་བཟང་པོ་དང་ཤིན་ཏུ་བཟང་དང་གྲགས་པ་དང་གྲགས་བྱིན་དང་། དགེ་བསྙེན་གྲགས་མཆོག་ཀྱང་ཐ་མའི་ཆ་དང་མཐུན་པའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤངས་པས་རྫུས་ཏེ་སྐྱེས་ཏེ་དེར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་ཞིང་འཇིག་རྟེན་འདིར་ཡང་ཕྱིར་མི་འོང་བའི་ཆོས་ཅན་གྱི་ཕྱིར་མི་འོང་བར་འགྱུར་རོ།
en: Nikaṭa, Kaḍaṅgara, Kātyarṣabha, Cāru, Upacāru, Ariṣṭa, Upāriṣṭa, Bhadra, Subhadra, Yaśas, Yaśodatta, and the lay brother Yaśottara, since they too had abandoned the five fetters that bind one to lower states, will also have miraculous births. There they will be completely emancipated and become never-returners, those who will naturally never return to this world.

source: །དགེ་སློང་དག་སྒྲ་ཅན་འདི་ཉིད་དུ་དགེ་བསྙེན་ཉིས་བརྒྱ་ལྔ་བཅུ་ལྷག་ཅིག་ཤི་བ་དེ་དག་ཀྱང་ཐ་མའི་ཆ་དང་མཐུན་པའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་རྣམས་སྤངས་པས་རྫུས་ཏེ་སྐྱེས་ཏེ་དེར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་ཞིང་འཇིག་རྟེན་འདིར་ཡང་ཕྱིར་མི་འོང་བའི་ཆོས་ཅན་གྱི་ཕྱིར་མི་འོང་བར་འགྱུར་རོ།
en: “Monks, here in Nādikā two hundred and fifty-one lay brothers have died. Since they had also abandoned the five fetters that bind one to lower states, they will have miraculous births. There they will be completely emancipated and become never-returners, those who will naturally never return to this world.

source: །དགེ་སློང་དག་སྒྲ་ཅན་འདི་ཉིད་དུ་དགེ་བསྙེན་སུམ་བརྒྱ་ཤི་བ་དེ་དག་ནི་ཀུན་དུ་སྦྱོར་བ་གསུམ་ཡང་སྤངས་ལ་འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་དག་ཀྱང་བསྲབས་པའི་ཕྱིར་ལན་གཅིག་ཕྱིར་འོང་བ་ཡིན་ཏེ། འཇིག་རྟེན་འདིར་ལན་གཅིག་ཕྱིར་འོངས་ནས་སྡུག་བསྔལ་མཐར་བྱེད་པར་འགྱུར་རོ།
en: “Monks, here in Nādikā three hundred other lay brothers have died. Since they had abandoned the three fetters and restrained desire, anger, and delusion, they are once-returners, those who will, after returning to this world once more, bring their suffering to an end.

source: །དགེ་སློང་དག་གྲོང་ཁྱེར་སྒྲ་ཅན་འདི་ཉིད་དུ་དགེ་བསྙེན་ལྔ་བརྒྱ་ལྷག་ཅིག་ཤི་བ་དེ་དག་ནི་ཀུན་དུ་སྦྱོར་བ་གསུམ་སྤངས་པས་རྒྱུན་དུ་ཞུགས་པ་རྣམ་པར་མི་ལྟུང་བའི་ཆོས་ཅན་རྫོགས་པའི་བྱང་ཆུབ་ལ་ངེས་པར་གཞོལ་བ། རེ་ལྟར་ཐོགས་ན་སྲིད་པ་བདུན་པ་ཡིན་ཏེ།
en: “Monks, here in the city of Nādikā five hundred and one other lay brothers have died. Since they had abandoned the three fetters, they are stream-enterers, those who will naturally never fall into inferior states, are firmly absorbed in awakening, and will have seven more lives at most.

source: ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་ལན་བདུན་དུ་ཉིང་མཚམས་སྦྱར་ཞིང་འཁོར་ནས་སྡུག་བསྔལ་གྱི་མཐར་བྱེད་པར་འགྱུར་རོ།
en: They will be reborn seven times among gods and humans and then bring their suffering to an end.

source: །དགེ་སློང་དག་ཁྱེད་དུས་ལས་འདས་ཤིང་ཤི་བར་གྱུར་པ་རྣམས་དེ་བཞིན་གཤེགས་པ་ལ་ཞུ་བ་ཞུ་བར་བྱེད་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་ཐོ་འཚམ་པ་ཡིན་ཏེ།
en: “Monks, it is scornful of the Tathāgata that you ask the Tathāgata about those who have passed away and died.

source: དེས་ན་དེ་བཞིན་གཤེགས་པ་བདེ་བར་མི་འགྱུར་རོ།
en: It does not please the Tathāgata.

source: །འོན་ཀྱང་སྐྱེ་བ་ཡོད་ན་འཆི་བའི་དུས་བྱེད་པ་ཡིན་ན་ངོ་མཚར་ཅི་ཞིག་ཡོད།
en: What wonder is there in the fact that someone who is born will die?

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་མ་བྱུང་ཡང་རུང་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དང་ཆོས་གནས་པ་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་འདི་ནི་གནས་པ་སྟེ།
en: The nature of phenomena, the enduring reality of phenomena, the element of phenomena endures whether tathāgatas appear or not.

source: དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱི་མངོན་པར་མཁྱེན་པས་མངོན་པར་བྱང་ཆུབ་ནས་གསུངས་ཏེ། འདོགས་པར་མཛད་རབ་ཏུ་འཇོག་པར་མཛད་རྣམ་པར་འབྱེད་པར་མཛད། རྣམ་པར་འགྲེལ་པར་མཛད་གསལ་བར་མཛད་འཆད་པར་མཛད། ཡང་དག་པར་རབ་ཏུ་འཆད་པར་མཛད་པ་ཡིན་ཏེ། འདི་ལྟ་སྟེ།
en: The Tathāgata himself, after having completely known and been completely awakened, explains, teaches, establishes, analyzes, interprets, clarifies, expounds—correctly and completely expounds—the following: Because this exists, that arises;

source: འདི་ཡོད་པས་འདི་འབྱུང་འདི་སྐྱེས་པས་འདི་སྐྱེ་བར་འགྱུར་ཏེ། འདི་ལྟ་སྟེ།
en: because this has been born, that will be born.

source: མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས་འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ་རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས།
en: Conditioned by ignorance, there are actions; conditioned by actions, there is consciousness; conditioned by consciousness, there are name and form;

source: མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག །སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ།
en: conditioned by name and form, there are the six sense spheres; conditioned by the six sense spheres, there is contact; conditioned by contact, there is perception; conditioned by perception, there is thirst;

source: ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ་ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ།
en: conditioned by thirst, there is attachment; conditioned by attachment, there is existence;

source: སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ་སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་འཁྲུགས་པ་རྣམས་རབ་ཏུ་འབྱུང་བར་འགྱུར་ཏེ།
en: conditioned by existence, there is birth; and conditioned by birth, there arise old age and death, sorrow, lamentation, pain, despair, and distress.

source: དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པ་འདི་འབྱུང་བར་འགྱུར་རོ། །འདི་ལྟ་སྟེ། འདི་མེད་ན་འདི་མི་འབྱུང་ལ་འདི་འགགས་ན་འདི་འགག་པར་འགྱུར་ཏེ། འདི་ལྟ་སྟེ།
en: Thus, this whole vast mass of suffering arises. “If this does not exist, that does not arise; if this has ceased, that will cease. With the cessation of ignorance, actions cease; with the cessation of actions, consciousness ceases; with the cessation of consciousness, name and form cease; with the cessation of name and form, the six sense spheres cease; with the cessation of the six sense spheres, contact ceases; with the cessation of contact, perception ceases;

source: མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག །འདུ་བྱེད་འགགས་པས་རྣམ་པར་ཤེས་པ་འགག །རྣམ་པར་ཤེས་པ་འགགས་པས་མིང་དང་གཟུགས་འགག །མིང་དང་གཟུགས་འགགས་པས་སྐྱེ་མཆེད་དྲུག་འགག །སྐྱེ་མཆེད་དྲུག་འགགས་པས་རེག་པ་འགག །རེག་པ་འགགས་པས་ཚོར་བ་འགག །ཚོར་བ་འགགས་པས་སྲེད་པ་འགག །སྲེད་པ་འགགས་པས་ལེན་པ་འགག །ལེན་པ་འགགས་པས་སྲིད་པ་འགག །སྲིད་པ་འགགས་པས་སྐྱེ་བ་འགག །སྐྱེ་བ་འགགས་པས་རྒ་ཤི་དང་མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་སྡུག་བསྔལ་བ་དང་ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འགག་པར་འགྱུར་ཏེ།
en: with the cessation of perception, thirst ceases; with the cessation of thirst, attachment ceases; with the cessation of attachment, existence ceases; with the cessation of existence, birth ceases; and with the cessation of birth, old age and death, sorrow, lamentation, pain, despair, and distress cease.

source: དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པོ་འདི་འགག་པར་འགྱུར་རོ།
en: Thus, this whole vast mass of suffering ceases.

source: །དགེ་སློང་དག་འོན་ཀྱང་ཁྱེད་ལ་ཆོས་ཀྱི་མེ་ལོང་གི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་ཀྱིས་དེ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: “Further, monks, I will teach you a teaching device of the Dharma called mirror of the Dharma. Listen to it well and keep it in mind; I shall teach it.

source: །ཆོས་ཀྱི་མེ་ལོང་གི་ཆོས་ཀྱི་རྣམ་གྲངས་གང་ཞེ་ན།
en: “What is the teaching device of the Dharma called mirror of the Dharma?

source: སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་ལ་ཤེས་ནས་དད་པ་ནི་ཆོས་ཀྱི་མེ་ལོང་གི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡིན་ནོ།
en: To understand and have faith in the Buddha, Dharma, and Saṅgha is the teaching device of the Dharma called mirror of the Dharma.

source: །འཕགས་པ་དགྱེས་པའི་ཚུལ་ཁྲིམས་ནི་ཆོས་ཀྱི་མེ་ལོང་གི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡིན་ཏེ།
en: Moral conduct pleasing to a noble one is the teaching device of the Dharma called mirror of the Dharma.

source: ངས་ཁྱེད་ལ་ཆོས་ཀྱི་མེ་ལོང་གི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་དོ་ཞེས་གང་གསུངས་པ་བཤད་པ་ནི་དེ་ཡིན་ནོ།
en: I said that I would teach you a teaching device of the Dharma called mirror of the Dharma, and this is it.” G. The Invitation by Āmrapālī

source: །ཨ་མྲ་སྐྱོང་མས་བཅོམ་ལྡན་འདས་སྤོང་བྱེད་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་སྒྲ་ཅན་དུ་བྱོན་ནས། སྒྲ་ཅན་གྱི་དྲང་སྲོང་སྒྲ་སྒྲོགས་ཀྱི་གནས་ན་བཞུགས་སོ། །ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་ཨ་མྲ་སྐྱོང་མ་དེ་ལ་ནེ་ཙོ་བཞིན་རྒྱས་ཞེས་བྱ་བ་མི་སྐད་ཤེས་པ་ཞིག་ཡོད་དེ། ནེ་ཙོ་བཞིན་རྒྱས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Āmrapālī heard that the Blessed One, traveling through the country of Vṛji, had arrived in Nādikā, and was staying at the ṛṣi Guṃjika’s abode in Nādikā. When she heard this, Āmrapālī said to her parrot named Pūrṇamukha, who understood human language, “Come, Pūrṇamukha, go to the Blessed One.

source: །བཞིན་རྒྱས་ཚུར་ཤོག །ཁྱོད་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ལ་ཕྱིན་ནས་ཁོ་མོའི་ཚིག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱོས་ལ། གནོད་པ་ཉུང་ངམ་ཉམ་ང་བ་ཆུང་ངམ། བསྐྱོད་པ་ཡང་ངམ་འཚོའམ་གནོད་པ་མ་མཆིས་སམ། སྟོབས་དང་བདེ་བར་རེག་པར་སྤྱོད་དམ་ཞེས་སྙུན་གསོལ་ལ།
en: When you arrive, bow low on my behalf until your forehead touches the Blessed One’s feet, and ask if the Blessed One is free from trouble, free from illness, in good physical condition, healthy, without any trouble, and living in vigor and comfort.

source: འདི་སྐད་ཅེས་ཨ་མྲ་སྐྱོང་མའི་མཆིད་ནས།
en: Then say, ‘This is a message from Āmrapālī:

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ནམ་ཡངས་པ་ཅན་དུ་གཤེགས་པ་དེའི་ཚེ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ། ཐོག་མར་བདག་གི་ཨ་མྲའི་ཚལ་དུ་གཤེགས་པར་གསོལ་ཅིག །དེ་ནས་ནེ་ཙོ་བཞིན་རྒྱས་ཀྱིས་ཨ་མྲ་སྐྱོང་མའི་ལྟར་མཉན་ནས།
en: “O Honored One, may the Blessed One have compassion for me and come first to my mango grove when you come to Vaiśālī.’ ”

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་བ་དེ་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱིའི་ཁྱེའུ་དག་གིས་མཐོང་ནས་དེ་དག་གིས་སྨྲས་པ།
en: “Certainly,” replied the parrot Pūrṇamukha to Āmrapālī, and he then went to the Blessed One.

source: ཤེས་ལྡན་དག་ནེ་ཙོ་འགྲོ་བ་འདི་ནི་སྨད་འཚོང་མའི་ཡིན་ནོ་ཞེས་དེ་དག་གིས་དེ་ལ་མདའ་འཕང་བར་བརྩམས་པ་ན། དེ་ཡང་དེ་དག་གི་སྟེང་དུ་བབས་སོ།
en: The boys of the Licchavi clan in Vaiśālī saw the parrot and said, “Sirs, the parrot flying there is the courtesan’s.” They shot arrows at it, but the arrows fell instead upon the boys themselves.

source: །དེ་ནས་ནེ་ཙོ་དེས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The parrot then spoke a verse:

source: ཡུལ་འཁོར་གཞན་ཡང་འགྱེད་པར་ཡང་།
en: “Even at a time of war against another country,

source: །ཕོ་ཉ་མི་གསོད་ཅེས་གྲག་ན།
en: It is said that messengers are not killed. Needless to say, nobody will kill me,

source: །བདག་ལྟ་རྒྱལ་བའི་ཕོ་ཉ་བས། །ལུས་ཅན་ཀུན་གྱིས་ག་ལ་སོད།
en: Because I am a messenger to the Victor.”

source: །དེ་རྣམས་ཀྱིས་ཀྱང་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The boys also spoke a verse:

source: ཁྱོད་ཀྱི་ཚིག་གིས་མདའ་འཕངས་པ།
en: “If, by the force of your words, the arrows shot were repulsed,

source: །ལྡོག་ན་བདག་ཅག་སྨོས་ཅི་དགོས།
en: Needless to say, we will retreat.

source: །ཁྱོད་ནི་རྫུ་འཕྲུལ་ཆེས་བསྐྱབས་པས།
en: Because you are protected by a great magical power,

source: །འཇིགས་པ་མེད་པར་འགྲོ་བར་གྱིས།
en: You should proceed without fear.”

source: །དེ་ནས་ནེ་ཙོ་བཞིན་རྒྱས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Thereupon the parrot Pūrṇamukha went to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་ཨ་མྲ་སྐྱོང་མ་མགོ་བོས་ཕྱག་འཚལ་ནས་གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཆུང་ངམ་བསྐྱོད་པ་ཡང་ངམ་འཚོའམ་གནོད་པ་མ་མཆིས་སམ། སྟོབས་དང་བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་སྙུན་གསོལ་ལགས་སོ།
en: When it arrived, it bowed low until its forehead touched the Blessed One’s feet, and then it said to him, “O Honored One, Āmrapālī bows low until her forehead touches the Blessed One’s feet, and asks if the Blessed One is free from trouble, free from illness . . . and living in vigor and comfort.”

source: །བཞིན་རྒྱས་ཁྱོད་དང་ཨ་མྲ་སྐྱོང་མ་བདེ་བར་གྱུར་ཅིག །བཙུན་པ་ཨ་མྲ་སྐྱོང་མའི་མཆིད་ནས་བཅོམ་ལྡན་འདས་ནམ་ཡངས་པ་ཅན་དུ་གཤེགས་པ་དེའི་ཚེ་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ།
en: “Pūrṇamukha, I hope you and Āmrapālī are living in comfort, too.” “Honored One, this is a message from Āmrapālī:

source: ཐོག་མར་བདག་གི་ཨ་མྲའི་ཚལ་དུ་གཤེགས་སུ་གསོལ་ཞེས་དེ་སྐད་མཆི་ལགས་སོ།
en: ‘O Honored One, may the Blessed One have compassion on me and come first to my mango grove when you come to Vaiśālī.’”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ནེ་ཙོ་བཞིན་རྒྱས་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One assented to the parrot Pūrṇamukha by remaining silent.

source: །དེ་ནས་ནེ་ཙོ་བཞིན་རྒྱས་ཀྱིས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་སོང་ངོ་།
en: Then the parrot Pūrṇamukha, knowing that the Blessed One had assented by remaining silent, bowed low until its forehead touched the Blessed One’s feet, and departed from the Blessed One’s presence.

source: །དེ་བཅོམ་ལྡན་འདས་ལ་དང་བ་བསྐྱེད་ནས་སོང་བ་ལས་རིང་པོ་མ་ལོན་པ་ཁོ་ནར་འོལ་བས་སྲོག་དང་ཕྲལ་ཏེ་དུས་བྱས་ནས་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་སུ་སྐྱེས་སོ།
en: Soon after it had gained faith in the Blessed One and departed, it was killed by a kite and reborn among the gods attendant on the Four Great Kings.

source: །ཆོས་ཉིད་ཀྱིས་སྐྱེས་ནས་རིང་པོ་མ་ལོན་པའི་ལྷའི་བུ་འམ་ལྷའི་བུ་མོ་ནི་སེམས་གསུམ་སྐྱེ་བར་འགྱུར་ཏེ། གང་ནས་ཤི་འཕོས་པ་དང་། གང་དུ་སྐྱེས་པ་དང་། ལས་གང་གིས་ཡིན་པའོ། །དེས་བལྟས་ནས་དུད་འགྲོ་ལས་ཤི་འཕོས་པ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་སུ་སྐྱེས་པ་དང་། བཅོམ་ལྡན་འདས་ལ་སེམས་མངོན་པར་དད་པས་སོ།
en: It is natural for gods or goddesses to give rise to three thoughts just after birth, namely, where they died, where they were reborn, and by what action. The god observed that he had died in the animal world, that he had been born among the gods attendant on the Four Great Kings, and that this was because his mind was filled with faith in the Blessed One.

source: །དེ་ནས་སྔོན་ནེ་ཙོ་བྱེད་པའི་ལྷའི་བུ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཞག་ལོན་ནས་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འགྲོ་བ་ནི་བདག་ལ་རིགས་པ་མ་ཡིན་གྱིས། ཅི་ནས་ཀྱང་བདག་ཞག་མ་ལོན་པ་ཁོ་ནར་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འགྲོའོ་སྙམ་ནས།
en: Then the god who had once been the parrot Pūrṇamukha thought, “Since it would not be appropriate for me to let any days pass before going to see the Blessed One, by all means I will go to see the Blessed One before any days have passed.”

source: དེ་ནས་སྔོན་ནེ་ཙོ་བྱེད་པའི་ལྷའི་བུ་རྣ་ཆ་གདུབ་འཁོར་དྲི་མ་མེད་པ་གཡོ་བ་ཐོགས་ཤིང་སེ་མོ་དོ་དང་། དོ་ཤལ་གྱིས་ལུས་བརྒྱན་ནས། དེ་ཉིད་ཀྱི་ནུབ་མོ་ལྷ་རྣམས་ཀྱི་མེ་ཏོག་ཨུཏྤ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། མན་དཱ་ར་བའི་མེ་ཏོག་གིས། ཐུ་བ་བཀང་ནས་ཤིན་ཏུ་འཕགས་ཤིང་མངོན་པར་འཕགས་པའི་ཁ་དོག་གིས། དེའི་ནུབ་མོ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Having thought this, the god who had once been the parrot then put on untarnished, swinging earrings, adorned himself with a necklace and a half necklace, filled the front part of his garment with divine utpala, padma, kumuda, puṇḍarīka, and mandārava flowers, and that night went to the Blessed One, displaying his extremely, exceptionally noble figure.

source: བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་གིས་གཏོར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ།
en: When he arrived, he scattered flowers for the Blessed One and sat down in front of him.

source: །དེའི་ཚེ་སྔོན་ནེ་ཙོ་བྱེད་པའི་ལྷའི་བུའི་ཁ་དོག་གི་མཐུས་སྣང་བ་རྒྱ་ཆེན་པོས་སྒྲ་སྒྲོགས་ཀྱི་འདུག་གནས་ཐམས་ཅད་གསལ་བར་གྱུར་ཏོ།། །།འདུལ་བ་གཞི། བམ་པོ་ཉི་ཤུ་བརྒྱད་པ།
en: At that time, by the force of the figure of the god who had once been the parrot, a vast display of light filled the entire neighborhood of Nādikā.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་ནེ་ཙོ་བྱེད་པའི་ལྷའི་བུའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་ཁམས་དང་རང་བཞིན་མཁྱེན་ནས་དེ་དང་མཐུན་པའི་འཕགས་པའི་བདེན་པ་བཞི་སོ་སོར་རྟོགས་པར་འགྱུར་བའི་ཆོས་བཤད་པ་མཛད་དེ་དེ་ཐོས་པས་སྔོན་ནེ་ཙོ་བྱེད་པའི་ལྷའི་བུས་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ་བདེན་པ་མཐོང་ནས་ལན་གསུམ་དུ་ཆེད་དུ་བརྗོད་པས་ཆེད་དུ་བརྗོད་པ།
en: The Blessed One knew the thinking, proclivity, disposition, and nature of the god who had once been the parrot, and preached the Dharma that was appropriate for him and that caused him to penetrate the four truths of the noble ones. When the god who had once been the parrot had heard the Dharma, he leveled the twenty high peaks of the mountain chain of the false view of individuality with the vajra of knowledge and actualized the fruit of stream-entry. After having seen the truths, he spoke an inspired utterance three times:
